package drivePractice06Q2;

public class Question {
//	Ｑ１
//
//	メソッドがどう実装するか決まっていない時、ある英単語をつけると
//	「あいまい」という意味になる。その英単語とは？
// 	A. abstract
//	ーーーーーーーーーーーーーーーーーーーーーーーーーーーーーーーーーー
//
//	Ｑ２
//
//	Ｑ１で答えた英単語をつけたメソッドは何と呼ばれているか。
//	A. 抽象メソッド
//	ーーーーーーーーーーーーーーーーーーーーーーーーーーーーーーーーーー
//
//	Ｑ３
//
//	Ｑ２で答えたメソッドと通常のメソッドとの記述の仕方での違いは？
//	A. 	
//	ーーーーーーーーーーーーーーーーーーーーーーーーーーーーーーーーーー
//
//	Ｑ４
//
//	Ｑ２で答えたメソッドを定義した際にクラスの宣言に対して気を付ける事は？
//
//	ーーーーーーーーーーーーーーーーーーーーーーーーーーーーーーーーーー
//
//	Ｑ５
//
//	Ｑ４で答えたクラスを何というか。
//
//	ーーーーーーーーーーーーーーーーーーーーーーーーーーーーーーーーーー
//
//	Ｑ６
//
//	Ｑ５で答えたクラスが禁止されている事は？
//
//	ーーーーーーーーーーーーーーーーーーーーーーーーーーーーーーーーーー
//
//	Ｑ７
//
//	Ｑ２で答えたメソッドを継承したクラスに強制できる事とは？
//
//	ーーーーーーーーーーーーーーーーーーーーーーーーーーーーーーーーーー
//
//	Ｑ８
//
//	Ｑ７で答えた事をするとコンパイルエラーがなくなるが、
//	それ以外でコンパイルエラーにならない方法とは？
//
//	ーーーーーーーーーーーーーーーーーーーーーーーーーーーーーーーーーー
//
//	Ｑ９
//
//	多階層の抽象について。
//	継承図で上に辿れば辿るほどクラスはどうなるか？
//
//	ーーーーーーーーーーーーーーーーーーーーーーーーーーーーーーーーーー
//
//	Ｑ10
//
//	多階層の抽象について。
//	継承図で下に辿れば辿るほどクラスはどうなるか？
//
//	ーーーーーーーーーーーーーーーーーーーーーーーーーーーーーーーーーー
//
//	Ｑ11
//
//	インターフェースについて。
//	フィールドとメソッドの特徴は？
//
//	ーーーーーーーーーーーーーーーーーーーーーーーーーーーーーーーーーー
//
//	Ｑ12
//
//	通常クラスがインターフェイスを継承する際に用いる英単語は？
//
//	ーーーーーーーーーーーーーーーーーーーーーーーーーーーーーーーーーー
//
//	Ｑ13
//
//	インターフェイスがインターフェイスを継承する際に用いる英単語は？
//
//	ーーーーーーーーーーーーーーーーーーーーーーーーーーーーーーーーーー
//
//	Ｑ14
//
//	通常クラスの継承では出来ないが、インターフェイスの継承で出来る事は？
//
//	ーーーーーーーーーーーーーーーーーーーーーーーーーーーーーーーーーー
//
//	Ｑ15
//
//	Ｑ14で答えた事について。
//	なぜ出来るのか？
//
//	ーーーーーーーーーーーーーーーーーーーーーーーーーーーーーーーーーー
//
//	Ｑ16
//	クラスの宣言でextendsとimplementsを同時に用いれるが、
//	順番はどうか？
}
